/**
 * Author: oucheng(ougato@gmail.com)
 * Copyright (c) 2018-03
 */

/**
 * 语言（中文）
 */

const language = {
    // 游戏内容
    1: "HTTP 获取数据 解析JSON失败",
    2: "HTTP 请求返回 状态错误：{0}",
    3: "HTTP 请求数据 转换JSON失败",
    4: "HTTP 连接已超时",
    5: "上次进入游戏还存在",
    6: "网络已断开",
    7: "网络数据发送失败",
    8: "当前网络不稳定",
    9: "网络错误",
    10: "网络已连接",
    11: "正在连接",
    12: "正在重连",
    13: "是否重连",
    14: "调用【网页授权获取用户信息】接口失败",
    15: "未知错误",
    16: "微信用户信息写入三方服务器失败",
    17: "使用微信客户端或微信开发者工具登录小游戏",
    18: "登录失败 错误码：{0} 错误信息：{1}",
    19: "获取用户信息失败，是否重试？",
    20: "错误码：{0} 错误信息：{1}",
    21: "HTTP 请求错误：{0}",
    22: "退出微信小游戏失败",
    23: "授权已到期，请重新登录",
    24: "网络断开，尝试重连",
    25: "服务器未响应，请重试",
    26: "服务器未启动，请重试",
    27: "功能暂未开放，敬请期待",
    28: "登录失败 错误码：{0}",
    29: "加入房间失败 错误码：{0}",
    30: "签名验证失败，请重新登录",
    31: "获取微信用户信息失败"
};

module.exports = language;